---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointElementOffset
source: html/583b515d-e08d-e8b5-dc86-2e4c532d4a1b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointElementOffset Property

"Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId PointElementOffset { get; }
```